#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan for staging</summary>

```terraform
Acquiring state lock. This may take a few moments...
random_password.db_password: Refreshing state... [id=none]
aws_iam_user.s3_user: Refreshing state... [id=receiptly-staging-s3-user]
module.receipts_bucket.aws_s3_bucket.this: Refreshing state... [id=receiptly-staging-receipts]
aws_iam_access_key.s3_user: Refreshing state... [id=AKIA5ZJTSBRRPYO6ZRE3]
module.receipts_bucket.aws_s3_bucket_public_access_block.this: Refreshing state... [id=receiptly-staging-receipts]
module.receipts_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=receiptly-staging-receipts]
aws_iam_user_policy.s3_access: Refreshing state... [id=receiptly-staging-s3-user:receiptly-staging-s3-access]
module.receipts_bucket.aws_s3_bucket_server_side_encryption_configuration.this: Refreshing state... [id=receiptly-staging-receipts]
module.receipts_bucket.aws_s3_bucket_lifecycle_configuration.this[0]: Refreshing state... [id=receiptly-staging-receipts]
module.secrets.aws_secretsmanager_secret.this["receiptly/s3/credentials"]: Refreshing state... [id=arn:aws:secretsmanager:ap-southeast-1:947685297250:secret:receiptly/s3/credentials-9FxMyd]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.receipts_bucket.aws_s3_bucket.this has been deleted
  - resource "aws_s3_bucket" "this" {
      - arn                         = "arn:aws:s3:::receiptly-staging-receipts" -> null
      - bucket_domain_name          = "receiptly-staging-receipts.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "receiptly-staging-receipts.s3.ap-southeast-1.amazonaws.com" -> null
      - id                          = "receiptly-staging-receipts" -> null
        tags                        = {
            "Environment" = "staging"
            "Project"     = "receiptly"
            "Purpose"     = "Receipt Image Storage"
        }
        # (7 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # aws_iam_user_policy.s3_access will be updated in-place
  ~ resource "aws_iam_user_policy" "s3_access" {
        id     = "receiptly-staging-s3-user:receiptly-staging-s3-access"
        name   = "receiptly-staging-s3-access"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                          - "s3:ListBucket",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::receiptly-staging-receipts",
                          - "arn:aws:s3:::receiptly-staging-receipts/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # random_password.db_password will be destroyed
  # (because random_password.db_password is not in configuration)
  - resource "random_password" "db_password" {
      - bcrypt_hash      = (sensitive value) -> null
      - id               = "none" -> null
      - length           = 32 -> null
      - lower            = true -> null
      - min_lower        = 0 -> null
      - min_numeric      = 0 -> null
      - min_special      = 0 -> null
      - min_upper        = 0 -> null
      - number           = true -> null
      - numeric          = true -> null
      - override_special = "!#$%&*()-_=+[]{}<>:?" -> null
      - result           = (sensitive value) -> null
      - special          = true -> null
      - upper            = true -> null
    }

  # module.database.aws_db_instance.postgres will be created
  + resource "aws_db_instance" "postgres" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-04:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "receiptly"
      + db_subnet_group_name                  = "receiptly-staging-db-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + enabled_cloudwatch_logs_exports       = [
          + "postgresql",
          + "upgrade",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "16.3"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "receiptly-staging-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:04:00-mon:05:00"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = true
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp2"
      + tags                                  = {
          + "Environment" = "staging"
          + "Name"        = "receiptly-staging-postgres"
          + "Project"     = "receiptly"
        }
      + tags_all                              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "receiptly-staging-postgres"
          + "Project"     = "receiptly"
        }
      + timezone                              = (known after apply)
      + username                              = "postgres"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.database.aws_db_subnet_group.main will be created
  + resource "aws_db_subnet_group" "main" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "receiptly-staging-db-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Environment" = "staging"
          + "Name"        = "receiptly-staging-db-subnet-group"
          + "Project"     = "receiptly"
        }
      + tags_all                = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "receiptly-staging-db-subnet-group"
          + "Project"     = "receiptly"
        }
      + vpc_id                  = (known after apply)
    }

  # module.database.aws_security_group.db will be created
  + resource "aws_security_group" "db" {
      + arn                    = (known after apply)
      + description            = "Security group for RDS PostgreSQL instance"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "PostgreSQL from VPC"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = "receiptly-staging-db-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "staging"
          + "Name"        = "receiptly-staging-db-sg"
          + "Project"     = "receiptly"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "receiptly-staging-db-sg"
          + "Project"     = "receiptly"
        }
      + vpc_id                 = (known after apply)
    }

  # module.database.random_password.db_password will be created
  + resource "random_password" "db_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.receipts_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "receiptly-staging-receipts"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "staging"
          + "Project"     = "receiptly"
          + "Purpose"     = "Receipt Image Storage"
        }
      + tags_all                    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "receiptly"
          + "Purpose"     = "Receipt Image Storage"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.receipts_bucket.aws_s3_bucket_public_access_block.this must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
      ~ bucket                  = "receiptly-staging-receipts" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "receiptly-staging-receipts" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.receipts_bucket.aws_s3_bucket_versioning.this must be replaced
-/+ resource "aws_s3_bucket_versioning" "this" {
      ~ bucket = "receiptly-staging-receipts" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "receiptly-staging-receipts" -> (known after apply)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.secrets.aws_secretsmanager_secret.this["receiptly/database/credentials"] will be created
  + resource "aws_secretsmanager_secret" "this" {
      + arn                            = (known after apply)
      + description                    = "PostgreSQL database credentials for Receiptly staging"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "receiptly/database/credentials"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 7
      + tags                           = {
          + "Environment" = "staging"
          + "Project"     = "receiptly"
        }
      + tags_all                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "receiptly"
        }
    }

  # module.vpc.aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "receiptly-staging-igw"
        }
      + tags_all = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "receiptly-staging-igw"
          + "Project"     = "receiptly"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "receiptly-staging-public-rt"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "receiptly-staging-public-rt"
          + "Project"     = "receiptly"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_security_group.ecs_tasks will be created
  + resource "aws_security_group" "ecs_tasks" {
      + arn                    = (known after apply)
      + description            = "Security group for ECS tasks"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow inbound traffic on port 8000"
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8000
            },
        ]
      + name                   = "receiptly-staging-ecs-tasks-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "receiptly-staging-ecs-tasks-sg"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "receiptly-staging-ecs-tasks-sg"
          + "Project"     = "receiptly"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "receiptly-staging-private-ap-southeast-1a"
          + "Type" = "private"
        }
      + tags_all                                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "receiptly-staging-private-ap-southeast-1a"
          + "Project"     = "receiptly"
          + "Type"        = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "receiptly-staging-private-ap-southeast-1b"
          + "Type" = "private"
        }
      + tags_all                                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "receiptly-staging-private-ap-southeast-1b"
          + "Project"     = "receiptly"
          + "Type"        = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "receiptly-staging-public-ap-southeast-1a"
          + "Type" = "public"
        }
      + tags_all                                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "receiptly-staging-public-ap-southeast-1a"
          + "Project"     = "receiptly"
          + "Type"        = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "receiptly-staging-public-ap-southeast-1b"
          + "Type" = "public"
        }
      + tags_all                                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "receiptly-staging-public-ap-southeast-1b"
          + "Project"     = "receiptly"
          + "Type"        = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "receiptly-staging-vpc"
        }
      + tags_all                             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "receiptly-staging-vpc"
          + "Project"     = "receiptly"
        }
    }

Plan: 20 to add, 1 to change, 3 to destroy.

Changes to Outputs:
  + db_instance_address         = (known after apply)
  + db_instance_endpoint        = (known after apply)
  + db_instance_port            = (known after apply)
  + db_name                     = "receiptly"
  + private_subnet_ids          = [
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_ids           = [
      + (known after apply),
      + (known after apply),
    ]
  ~ receipts_bucket_arn         = "arn:aws:s3:::receiptly-staging-receipts" -> (known after apply)
  ~ receipts_bucket_name        = "receiptly-staging-receipts" -> (known after apply)
  ~ setup_complete              = <<-EOT
        ✅ Terraform setup complete!
            
        📦 S3 Bucket: receiptly-staging-receipts
        🔐 Database Secret: receiptly/database/credentials
        🔐 S3 Secret: receiptly/s3/credentials
            
        Retrieve credentials:
            
        # Database credentials
        aws secretsmanager get-secret-value --secret-id receiptly/database/credentials --query SecretString --output text | jq
            
        # S3 credentials
        aws secretsmanager get-secret-value --secret-id receiptly/s3/credentials --query SecretString --output text | jq
    EOT -> (known after apply)
  + vpc_id                      = (known after apply)

```

</details>

*Pushed by: @eddykuhan, Action: `pull_request`*